art-share-api-final/art-share/app/controllers/artworks_controller.rb

    def destroy
        artwork = Artwork.find_by(id: params[:id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]